Repository: Mulli/phpxlexport
Catalog: languages/phpspreadsheet-wp-*.po
Languages: ar, he_il

source: PhpSpreadsheet for WordPress requires PHP 7.4 or higher.
ar: PhpSpreadsheet لـ WordPress يتطلب PHP 7.4 أو أحدث.
he_il: PhpSpreadsheet עבור WordPress דורש PHP 7.4 או גרסה חדשה יותר.

source: PhpSpreadsheet Settings
ar: إعدادات PhpSpreadsheet
he_il: הגדרות PhpSpreadsheet

source: PhpSpreadsheet Configuration
ar: تكوين PhpSpreadsheet
he_il: תצורת PhpSpreadsheet

source: Auto-load Library
ar: تحميل المكتبة تلقائياً
he_il: טעינה אוטומטית של הספרייה

source: Installation Method
ar: طريقة التثبيت
he_il: שיטת התקנה

source: Configure PhpSpreadsheet library settings for WordPress.
ar: تكوين إعدادات مكتبة PhpSpreadsheet لـ WordPress.
he_il: הגדר את הגדרות ספריית PhpSpreadsheet עבור WordPress.

source: Load PhpSpreadsheet automatically
ar: تحميل PhpSpreadsheet تلقائياً
he_il: טען את PhpSpreadsheet אוטומטית

source: When enabled, PhpSpreadsheet will be loaded on every WordPress page load.
ar: عند التفعيل، سيتم تحميل PhpSpreadsheet في كل تحميل صفحة WordPress.
he_il: כאשר מופעל, PhpSpreadsheet ייטען בכל טעינת עמוד של WordPress.

source: Automatic (Try Composer, then Precompiled)
ar: تلقائي (جرب Composer، ثم المجمع مسبقاً)
he_il: אוטומטי (נסה Composer, לאחר מכן מקומפל מראש)

source: Composer Only
ar: Composer فقط
he_il: Composer בלבד

source: Precompiled Only
ar: المجمع مسبقاً فقط
he_il: מקומפל מראש בלבד

source: Precompiled Download Only
ar: تحميل مجمع مسبقاً فقط
he_il: הורדה מקומפלת מראש בלבד

source: Choose how PhpSpreadsheet should be installed.
ar: اختر كيفية تثبيت PhpSpreadsheet.
he_il: בחר כיצד להתקין את PhpSpreadsheet.

source: Choose how PhpSpreadsheet should be installed. Automatic is recommended for most users.
ar: اختر كيفية تثبيت PhpSpreadsheet. التلقائي موصى به لمعظم المستخدمين.
he_il: בחר כיצד להתקין את PhpSpreadsheet. אוטומטי מומלץ לרוב המשתמשים.

source: PhpSpreadsheet for WordPress activated successfully!
ar: تم تفعيل PhpSpreadsheet لـ WordPress بنجاح!
he_il: PhpSpreadsheet עבור WordPress הופעל בהצלחה!

source: PhpSpreadsheet for WordPress activated but library installation failed. Please check settings.
ar: تم تفعيل PhpSpreadsheet لـ WordPress لكن فشل تثبيت المكتبة. يرجى فحص الإعدادات.
he_il: PhpSpreadsheet עבור WordPress הופעל אך התקנת הספרייה נכשלה. אנא בדוק את ההגדרות.

source: PhpSpreadsheet library is not installed.
ar: مكتبة PhpSpreadsheet غير مثبتة.
he_il: ספריית PhpSpreadsheet אינה מותקנת.

source: Install now
ar: ثبت الآن
he_il: התקן עכשיו

source: PhpSpreadsheet for WordPress requires PHP %s or higher. You are running PHP %s.
ar: PhpSpreadsheet لـ WordPress يتطلب PHP %s أو أحدث. أنت تستخدم PHP %s.
he_il: PhpSpreadsheet עבור WordPress דורש PHP %s או גרסה חדשה יותר. אתה מריץ PHP %s.

source: Plugin Activation Error
ar: خطأ في تفعيل الإضافة
he_il: שגיאת הפעלת תוסף

source: PhpSpreadsheet for WordPress requires the following PHP functions: %s
ar: PhpSpreadsheet لـ WordPress يتطلب دوال PHP التالية: %s
he_il: PhpSpreadsheet עבור WordPress דורש את פונקציות PHP הבאות: %s

source: Security check failed
ar: فشل في فحص الأمان
he_il: בדיקת אבטחה נכשלה

source: Insufficient permissions
ar: صلاحيات غير كافية
he_il: אין הרשאות מספקות

source: Installation completed successfully
ar: تم إكمال التثبيت بنجاح
he_il: ההתקנה הושלמה בהצלחה

source: Installation completed but library failed to load
ar: تم إكمال التثبيت لكن فشل تحميل المكتبة
he_il: ההתקנה הושלמה אך הספרייה נכשלה להיטען

source: Installation failed. Please check logs for details.
ar: فشل التثبيت. يرجى فحص السجلات للتفاصيل.
he_il: ההתקנה נכשלה. אנא בדוק את היומנים לפרטים.

source: Status check failed
ar: فشل فحص الحالة
he_il: בדיקת סטטוס נכשלה

source: Logs cleared successfully
ar: تم مسح السجلات بنجاح
he_il: היומנים נוקו בהצלחה

source: Integrate PhpSpreadsheet library into WordPress for Excel file generation with seamless compatibility.
ar: دمج مكتبة PhpSpreadsheet في WordPress لإنشاء ملفات Excel مع توافق سلس.
he_il: שלב ספריית PhpSpreadsheet ב-WordPress ליצירת קבצי Excel עם תאימות חלקה.

source: Library Status
ar: حالة المكتبة
he_il: סטטוס הספרייה

source: PhpSpreadsheet is loaded and ready
ar: PhpSpreadsheet محمل وجاهز
he_il: PhpSpreadsheet נטען ומוכן לשימוש

source: Version: %s
ar: الإصدار: %s
he_il: גרסה: %s

source: PhpSpreadsheet is not loaded
ar: PhpSpreadsheet غير محمل
he_il: PhpSpreadsheet לא נטען

source: Library needs to be installed
ar: المكتبة تحتاج للتثبيت
he_il: יש להתקין את הספרייה

source: Install PhpSpreadsheet
ar: ثبت PhpSpreadsheet
he_il: התקן PhpSpreadsheet

source: Check Status
ar: فحص الحالة
he_il: בדוק סטטוס

source: View Logs
ar: عرض السجلات
he_il: הצג יומנים

source: Installation Details
ar: تفاصيل التثبيت
he_il: פרטי התקנה

source: Vendor Directory
ar: مجلد Vendor
he_il: תיקיית Vendor

source: Exists
ar: موجود
he_il: קיים

source: Missing
ar: مفقود
he_il: חסר

source: Autoloader
ar: المحمل التلقائي
he_il: טעינה אוטומטית

source: Available
ar: متوفر
he_il: זמין

source: PhpSpreadsheet Library
ar: مكتبة PhpSpreadsheet
he_il: ספריית PhpSpreadsheet

source: Installed
ar: مثبت
he_il: מותקן

source: Not Installed
ar: غير مثبت
he_il: לא מותקן

source: Settings
ar: الإعدادات
he_il: הגדרות

source: Load PhpSpreadsheet automatically on every page
ar: تحميل PhpSpreadsheet تلقائياً في كل صفحة
he_il: טען PhpSpreadsheet אוטומטית בכל עמוד

source: When enabled, PhpSpreadsheet will be loaded on every WordPress page load. Disable if you only need it for specific functionality.
ar: عند التفعيل، سيتم تحميل PhpSpreadsheet في كل تحميل صفحة WordPress. قم بالإلغاء إذا كنت تحتاجه فقط لوظائف محددة.
he_il: כאשר מופעל, PhpSpreadsheet ייטען בכל טעינת עמוד WordPress. בטל אם אתה צריך את זה רק לפונקציונליות ספציפית.

source: Usage Information
ar: معلومات الاستخدام
he_il: מידע על שימוש

source: For Developers
ar: للمطورين
he_il: למפתחים

source: Once installed, PhpSpreadsheet is automatically available throughout your WordPress installation:
ar: بمجرد التثبيت، يصبح PhpSpreadsheet متاحاً تلقائياً في جميع أنحاء تثبيت WordPress الخاص بك:
he_il: לאחר ההתקנה, PhpSpreadsheet זמין אוטומטית בכל התקנת WordPress שלך:

source: Copy Code
ar: نسخ الكود
he_il: העתק קוד

source: Helper Functions
ar: دوال المساعدة
he_il: פונקציות עזר

source: The plugin provides convenient helper functions:
ar: تقدم الإضافة دوال مساعدة مريحة:
he_il: התוסף מספק פונקציות עזר נוחות:

source: Check if library is loaded
ar: فحص ما إذا كانت المكتبة محملة
he_il: בדוק אם הספרייה נטענה

source: Get library version
ar: الحصول على إصدار المكتبة
he_il: קבל גרסת הספרייה

source: Force load library
ar: إجبار تحميل المكتبة
he_il: אלץ טעינת הספרייה

source: Installation Paths
ar: مسارات التثبيت
he_il: נתיבי התקנה

source: The plugin checks these paths for PhpSpreadsheet:
ar: تفحص الإضافة هذه المسارات لـ PhpSpreadsheet:
he_il: התוסף בודק את הנתיבים הללו עבור PhpSpreadsheet:

source: Found
ar: موجود
he_il: נמצא

source: Not found
ar: غير موجود
he_il: לא נמצא

source: System Information
ar: معلومات النظام
he_il: מידע מערכת

source: Plugin Version
ar: إصدار الإضافة
he_il: גרסת התוסף

source: WordPress Version
ar: إصدار WordPress
he_il: גרסת WordPress

source: PHP Version
ar: إصدار PHP
he_il: גרסת PHP

source: Memory Limit
ar: حد الذاكرة
he_il: מגבלת זיכרון

source: Max Execution Time
ar: الحد الأقصى لوقت التنفيذ
he_il: זמן ביצוע מקסימלי

source: seconds
ar: ثانية
he_il: שניות

source: Composer Available
ar: Composer متوفر
he_il: Composer זמין

source: Yes
ar: نعم
he_il: כן

source: No
ar: لا
he_il: לא

source: ZIP Extension
ar: امتداد ZIP
he_il: הרחבת ZIP

source: cURL Extension
ar: امتداد cURL
he_il: הרחבת cURL

source: Loaded
ar: محمل
he_il: נטען

source: Not Loaded
ar: غير محمل
he_il: לא נטען

source: Installation Logs
ar: سجلات التثبيت
he_il: יומני התקנה

source: Loading logs...
ar: تحميل السجلات...
he_il: טוען יומנים...

source: Refresh
ar: تحديث
he_il: רענן

source: Clear Logs
ar: مسح السجلات
he_il: נקה יומנים

source: Installing...
ar: جاري التثبيت...
he_il: מתקין...

source: Installing PhpSpreadsheet library...
ar: جاري تثبيت مكتبة PhpSpreadsheet...
he_il: מתקין ספריית PhpSpreadsheet...

source: Retry Installation
ar: إعادة المحاولة
he_il: נסה התקנה שוב

source: Installation failed due to network error
ar: فشل التثبيت بسبب خطأ في الشبكة
he_il: ההתקנה נכשלה עקב שגיאת רשת

source: Checking...
ar: جاري الفحص...
he_il: בודק...

source: Status check failed due to network error
ar: فشل فحص الحالة بسبب خطأ في الشبكة
he_il: בדיקת הסטטוס נכשלה עקב שגיאת רשת

source: Are you sure you want to clear all logs?
ar: هل أنت متأكد من أنك تريد مسح جميع السجلات؟
he_il: האם אתה בטוח שברצונך לנקות את כל היומנים?

source: Logs cleared successfully.
ar: تم مسح السجلات بنجاح.
he_il: היומנים נוקו בהצלחה.

source: No logs available.
ar: لا توجد سجلات متاحة.
he_il: אין יומנים זמינים.

source: Failed to load logs.
ar: فشل في تحميل السجلات.
he_il: נכשל בטעינת היומנים.

source: Failed to load logs due to network error.
ar: فشل في تحميل السجلات بسبب خطأ في الشبكة.
he_il: נכשל בטעינת היומנים עקב שגיאת רשת.

source: Code copied to clipboard!
ar: تم نسخ الكود إلى الحافظة!
he_il: הקוד הועתק ללוח!

source: loaded
ar: محمل
he_il: נטען

source: not_loaded
ar: غير محمل
he_il: לא נטען

source: warning
ar: تحذير
he_il: אזהרה

source: installing_message
he_il: מתקין ספריית PhpSpreadsheet...

source: network_error
ar: خطأ في الشبكة
he_il: שגיאת רשת

source: timeout_error
ar: انتهت مهلة التثبيت. يرجى المحاولة مرة أخرى.
he_il: פג זמן ההתקנה. אנא נסה שוב.

source: status_check_failed
he_il: בדיקת סטטוס נכשלה

source: confirm_clear_logs
he_il: האם אתה בטוח שברצונך לנקות את כל היומנים?

source: logs_cleared
he_il: היומנים נוקו בהצלחה

source: loading_logs
he_il: טוען יומנים...

source: no_logs
he_il: אין יומנים זמינים

source: load_logs_failed
he_il: נכשל בטעינת היומנים

source: copy_failed
he_il: נכשל בהעתקת הקוד

source: copied
ar: تم النسخ!
he_il: הועתק!

source: retry
ar: إعادة المحاولة
he_il: נסה שוב

source: check_status
ar: فحص الحالة
he_il: בדוק סטטוס
